In [1]:
import pandas as pd
import sqlite3

In [2]:
cnx = sqlite3.connect("base_datos_proveedores.db")

In [3]:
cursor_prov = cnx.cursor()

In [4]:
query = '''
CREATE TABLE proveedores (
id_proveedor INT PRIMARY KEY,
nombre TEXT NOT NULL,
direccion TEXT NOT NULL,
ciudad TEXT NOT NULL,
provincia TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [5]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...

In [16]:
query = ''' 
SELECT *
FROM proveedores
'''
pd.read_sql(query, cnx)

Empty DataFrame
Columns: [id_proveedor, nombre, direccion, ciudad, provincia]
Index: []

In [6]:
query = '''
CREATE TABLE piezas (
id_pieza INT PRIMARY KEY,
nombre TEXT NOT NULL,
color TEXT NOT NULL,
precio FLOAT NOT NULL,
categoria TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [7]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...

In [8]:
query = '''
CREATE TABLE categoria_pieza (
id_categoria INT PRIMARY KEY,
nombre_categoria TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [9]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...

In [10]:
query = ''' 
SELECT *
FROM categoria_pieza
'''
pd.read_sql(query, cnx)

Empty DataFrame
Columns: [id_categoria, nombre_categoria]
Index: []

In [12]:
query = '''
CREATE TABLE operaciones (
id_operacion INT PRIMARY KEY,
id_proveedor INT NOT NULL,
id_pieza INT NOT NULL,
fecha TEXT NOT NULL,
id_factura INT NOT NULL
) 
'''
cursor_prov.execute(query)

In [13]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...
3,table,operaciones,operaciones,8,CREATE TABLE operaciones (\nid_operacion INT P...

In [14]:
query = '''
CREATE TABLE facturas (
id_factura INT PRIMARY KEY,
id_proveedor INT NOT NULL,
id_pieza INT NOT NULL,
cantidad_piezas INT NOT NULL,
precio_ud INT NOT NULL,
total INT NOT NULL,
fecha_factura TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [15]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...
3,table,operaciones,operaciones,8,CREATE TABLE operaciones (\nid_operacion INT P...
4,table,facturas,facturas,10,CREATE TABLE facturas (\nid_factura INT PRIMAR...